# Advanced Pandas -- Part 1

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [1]:
#Write your code here
import pandas as pd
df_titanic = pd.read_csv("data\Titanic.csv", header = 0)
df_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [2]:
#Write your code here
df_titanic.rename(columns = {"Name":"Passenger_Name", "Ticket":"Ticket_Num"}, inplace = True)
df_titanic.head()

# #Write your code here (2nd way)
# df_titanic.rename({"Name":"Passenger_Name", "Ticket":"Ticket_Num"}, axis = 1, inplace = True)
# df_titanic.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Change the index of the df_titanic to the column PasengerId.

In [3]:
#Write your code here
df_titanic.set_index("PassengerId", inplace = True)
df_titanic.head()

,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Select the name of passenger 896

In [4]:
#Write your code here
df_titanic.loc[896, "Passenger_Name"]

'Hirvonen, Mrs. Alexander (Helga E Lindqvist)'

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [5]:
#Write your code here
df_titanic.reset_index(drop = False, inplace = True)
df_titanic.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

How many missing entries are there in the Age column? Use the isnull() method and recall that Booleans are exactly like 1s (True) and 0s (False).

In [6]:
#Write you code here
df_titanic.isna().sum()['Age']

86

Compute the avg age of passengers ignoring the missing data.

In [7]:
#Write your code here
df_titanic['Age'].mean()

30.272590361445783

Using the fillna() method replace the missing values in the Age column with the mean.

In [8]:
#Write your code here
df_titanic['Age'] = df_titanic['Age'].fillna(df_titanic['Age'].mean())

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [9]:
#Write your code here
df_titanic['Age'].sort_values(ascending = False).head(5).mean()

# #Write your code here (2nd way)
# df_titanic['Age'].sort_values(ascending = False).reset_index(drop = True).loc[:4, ].mean()

67.0

# Andvanced Pandas -- Part 2

In this practice exercise, we will analyze Chipotle order data.  The file "Chipotle.tsv" contains this information in a tab separated file.  First, read in the data.  You might find the delimiter input to the pandas read_csv method useful. Use the head method to check that everything has been read in correctly.

In [10]:
import pandas as pd
import numpy as np

#Write your code here
df = pd.read_csv("data/chipotle_orders.tsv", sep = "\t")
df.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

Now take a look at the dtypes attribute to see how the columns are stored.

In [11]:
df.dtypes

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

We will write code to answer the following questions:

1. What fraction of customers order burritos versus burrito bowls?
2. What is the average amount of money spent on a Chipotle order?

For question 1, we will use the apply method to create a column that will read "Burrito" for items that are a burrito, "Bowl" for items that are a bowl and "Other" for every other item.

In [12]:
def Burrito_or_Bowl(item):
    """Function to be used with apply. Takes an item and returns
    as described above."""
    
    item['item_name'] = item['item_name'].lower()
    
    if "burrito" in item['item_name']:
        order_name = "Burrito"
    elif "bowl" in item['item_name']:
        order_name = "Bowl"
    else:
        order_name = "Others"
    
    return order_name

Create new column called "Bowl_Burrito" and compute fractions of bowl versus burrito orders. The value_counts() method could be useful here.

In [13]:
#Write you code here
df['Bowl_or_Burrito'] = df.apply(Burrito_or_Bowl, axis = 1)

print("Fraction of orders")
print((df['Bowl_or_Burrito'].value_counts() / df['Bowl_or_Burrito'].shape[0]).sort_index())

Fraction of orders
Bowl       0.287971
Burrito    0.253570
Others     0.458460
Name: Bowl_or_Burrito, dtype: float64

For question 2, use iterrows to calculate the average price per order. Note that the item price column is a string, so first use string methods plut the as.type() method to recast this column as a float.

In [14]:
#Write your code here
df['new_item_price'] = df['item_price'].str.strip("$").astype('float')  # remove '$', convert to float
df['spending'] = df['new_item_price'] * df['quantity']

prices_per_order = {}

for i, r in df.iterrows():
    
    if r['order_id'] in prices_per_order.keys():
        prices_per_order[r['order_id']].append(r['spending'])
    else:
        prices_per_order[r['order_id']] = [r['spending']]

np.mean([sum(i) for i in prices_per_order.values()])

21.39423118865867

In [15]:
#Write your code here (An easier but slower way)
df['new_item_price'] = df['item_price'].str.strip("$").astype('float')  # remove '$', convert to float
df['spending'] = df['new_item_price'] * df['quantity']

prices_per_order = {r['order_id'] : [] for i, r in df.iterrows()}

for i, r in df.iterrows():
    prices_per_order[r['order_id']].append(r['spending'])

np.mean([sum(i) for i in prices_per_order.values()])

21.39423118865867

In [16]:
#Write your code here (The easiest way: groupby)
df['new_item_price'] = df['item_price'].str.strip("$").astype('float')  # remove '$', convert to float
df['spending'] = df['new_item_price'] * df['quantity']

df.groupby('order_id')[['spending']].sum()['spending'].mean()

21.394231188658654

In [17]:
#Write your code here (The easiest way: pivot_table)
df['new_item_price'] = df['item_price'].str.strip("$").astype('float')  # remove '$', convert to float
df['spending'] = df['new_item_price'] * df['quantity']

df.pivot_table(index = 'order_id', values = 'spending', aggfunc = 'sum')['spending'].mean()

21.394231188658654